---
type: DockablePaneState
namespace: Autodesk.Revit.UI
version: 2024
members: 10
tags: [revit-api, class]
---

# DockablePaneState

`Autodesk.Revit.UI.DockablePaneState` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DockablePaneState | — | `` |
| Constructor | DockablePaneState | 2014 | `public DockablePaneState ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | SetFloatingRectangle | 2014 | `public void SetFloatingRectangle ( Rectangle rect )` |
| Property | DockPosition | 2014 | `public DockPosition DockPosition { get ; set ; }` |
| Property | FloatingRectangle | 2014 | `public Rectangle FloatingRectangle { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MinimumHeight | 2020 | `public int MinimumHeight { get ; set ; }` |
| Property | MinimumWidth | 2020 | `public int MinimumWidth { get ; set ; }` |
| Property | TabBehind | 2014 | `public DockablePaneId TabBehind { get ; set ; }` |